---
kind: type
id: T:Autodesk.Revit.DB.PhaseStatusPresentation
source: html/84d5855c-fba2-b026-ee60-7f2a24b78129.htm
---
# Autodesk.Revit.DB.PhaseStatusPresentation

An enumerated type listing the options for element display in a phase filter.

## Syntax (C#)
```csharp
public enum PhaseStatusPresentation
```